Revit 2024 API
ConduitSizes.Contains Method
 Checks whether a conduit size with the nominal diameter exists.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool Contains(
	double nominalDiameter
)
Visual Basic
Public Function Contains ( _
	nominalDiameter As Double _
) As Boolean
Visual C++
public:
bool Contains(
	double nominalDiameter
)
Parameters
nominalDiameter
Type: System.Double
 Nominal diameter.
Return Value
 True if a conduit size with the nominal diameter exists.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for nominalDiameter must be greater than 0 and no more than 30000 feet.
See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace